
&НаКлиенте
Процедура ПолучитьСписок(Команда)
	ПолучитьСписокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокНаСервере()
	Соединение = Новый HTTPСоединение("192.168.56.101/demo_base2",,"");
	Запрос = Новый HTTPЗапрос("/odata/standard.odata/Catalog_Слова");
	Ответ = Соединение.ВызватьHTTPМетод("GET",Запрос);
	Если Ответ.КодСостояния = 200 Тогда               
		Парсер = Новый ЧтениеXML;
		Парсер.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		Построитель = Новый ПостроительDOM;
		Документ = Построитель.Прочитать(Парсер);
		Результат = "";    
		
		Для Каждого Э0 Из Документ.ДочерниеУзлы Цикл
			Для Каждого Э1 Из Э0.ДочерниеУзлы Цикл
				Если Э1.ИмяУзла = "entry" Тогда
					entry = Э1;
					Для Каждого Э2 Из entry.ДочерниеУзлы Цикл
						Если Э2.ИмяУзла = "content" Тогда
							content = Э2;
							Для Каждого Э3 Из content.ДочерниеУзлы Цикл
								Если Э3.ИмяУзла = "m:properties" Тогда
									properties = Э3;
									Для Каждого Э4 Из properties.ДочерниеУзлы Цикл
										Если Э4.ИмяУзла = "d:Description" Тогда
											Результат = Результат + Э4.ТекстовоеСодержимое + Символы.ПС;	
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Сообщить(Результат);
	Иначе
		Сообщить(Ответ.КодСостояния);
	КонецЕсли;

КонецПроцедуры  

//Обработка
&НаСервереБезКонтекста
Процедура УстановитьODataНаСервереНаСервере()
	тМассив = Новый Массив; 
	тМассив.Добавить(Метаданные.Справочники.Слова); 
	тМассив.Добавить(Метаданные.Справочники.Номенклатура);
	тМассив.Добавить(Метаданные.РегистрыСведений.Штрихкоды);
	УстановитьСоставСтандартногоИнтерфейсаOData(тМассив);
КонецПроцедуры

//Добавление
&НаСервере
Процедура ДобавитьНаСервере()
	Соединение = Новый HTTPСоединение("192.168.56.101/demo_base2",,"");
	Запрос = Новый HTTPЗапрос("/odata/standard.odata/Catalog_Слова?$format=json");
	СтрокаJSON = "{""Description"":"""+Слово+"""}";	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	Ответ = Соединение.ВызватьHTTPМетод("POST",Запрос);
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	Если НЕ ПустаяСтрока(Слово) Тогда
		ДобавитьНаСервере();
		Сообщить("Слово добавлено");
	КонецЕсли;
КонецПроцедуры

//Изменение
&НаСервере
Процедура ИзменитьНаСервере()
	Соединение = Новый HTTPСоединение("192.168.56.101/demo_base2",,"");
	Запрос = Новый HTTPЗапрос("/odata/standard.odata/Catalog_Слова(guid'"+Строка(СтароеСлово.УникальныйИдентификатор())+"')?$format=json");	
	СтрокаJSON = "{""Description"":"""+НовоеСлово+"""}";	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	Ответ = Соединение.ВызватьHTTPМетод("PATCH",Запрос);
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьНаСервере();
	Сообщить("Данные изменены");
КонецПроцедуры

//Удаление
&НаСервере
Процедура УдалитьНаСервере()
	Соединение = Новый HTTPСоединение("192.168.56.101/demo_base2",,"");
	Запрос = Новый HTTPЗапрос("/odata/standard.odata/Catalog_Слова(guid'"+Строка(СтароеСлово.УникальныйИдентификатор())+"')");
	Ответ = Соединение.ВызватьHTTPМетод("DELETE",Запрос);
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере();
	Сообщить("Слово удалено");
КонецПроцедуры
